app/views/items/edit.html.erb

SELECT `item_categories`.* FROM `item_categories`
---
    <%= item.label :item_category_id,"Item Category:" %><br />
    <%= item.select :item_category_id, options_for_select(ItemCategory.all.collect{ |u| [u.name, u.id] }), :prompt => "Select Item Category"%>