app/views/items/index.html.erb

SELECT  `item_categories`.* FROM `item_categories` WHERE `item_categories`.`id` IS NULL  ORDER BY `item_categories`.`id` DESC LIMIT 1
---
				<td><%=index+1%></td>
				<td><%=ItemCategory.where(id: item.item_category_id).last.name rescue nil%></td>