app/views/items/new.html.erb

SELECT `item_categories`.* FROM `item_categories`
---
      <label>Item Category Name:</label>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
      <%= select_tag "item[item_category_id]", options_for_select(ItemCategory.all.collect{ |u| [u.name, u.id] }), :prompt => "Select Item Category"  %>