app/controllers/item_categories_controller.rb

	def index
		@item_categories = ItemCategory.all
---
SELECT `item_categories`.* FROM `item_categories`

	def create
		@item = ItemCategory.new(item_category_params)
    	if @item.save
---
INSERT INTO `item_categories` (`name`, `created_at`, `updated_at`) VALUES ('Stationary', '2018-08-07 10:50:51.861522', '2018-08-07 10:50:51.861522')

	def edit
		@item = ItemCategory.find_by_id(params[:id])
---
SELECT  `item_categories`.* FROM `item_categories` WHERE `item_categories`.`id` = 1 LIMIT 1

	def update
		@item = ItemCategory.find_by_id(params[:id])
		if @item.update_attributes(item_category_params)
---
SELECT  `item_categories`.* FROM `item_categories` WHERE `item_categories`.`id` = 1 LIMIT 1
UPDATE `item_categories` SET `name` = 'Electronics Items', `updated_at` = '2018-08-07 11:02:42.485999' WHERE `item_categories`.`id` = 1