app/controllers/items_controller.rb

INSERT INTO `items` (`item_category_id`, `name`, `rate`, `created_at`, `updated_at`) VALUES (2, 'tshirit', '500', '2018-08-07 15:51:20.032061', '2018-08-07 15:51:20.032061')
---
	def create
		@item = Item.new(item_params)
    	if @item.save

SELECT `items`.* FROM `items`
---
	def index
		@item = Item.all

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 5 LIMIT 1
---
	def edit
		@item = Item.find_by_id(params[:id])

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 5 LIMIT 1
UPDATE `items` SET `rate` = '501', `updated_at` = '2018-08-07 16:35:38.079910' WHERE `items`.`id` = 5
---
	def update
		@item = Item.find_by_id(params[:id])
		if @item.update_attributes(item_params)

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 1
---
	def destroy
		item = Item.find_by_id(params[:id])
		item.destroy